app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---

<p><strong><%= @question.answers.count %> Answer(s):</strong></p>