app/controllers/answers_controller.rb

  def create
    answer = current_user.answers.build(answer_params)
    if answer.save
---
INSERT INTO "answers" ("user_id", "question_id", "content") VALUES (?, ?, ?)  [["user_id", 90], ["question_id", 1], ["content", "Write your answer here:"]]

  def set_question
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]