app/controllers/questions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 90], ["LIMIT", 1]]
---
  def new
    unless current_user == User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 90], ["LIMIT", 1]]
INSERT INTO "questions" ("content", "asker_id") VALUES (?, ?)  [["content", "Great questions!!"], ["asker_id", 90]]
---
  def create
    if current_user == User.find(params[:user_id])
      params[:question][:asker_id] = current_user.id
      @question = Question.create(question_params)