app/controllers/sessions_controller.rb

  def create
    # binding.pry
    if auth #coming from FB
      user = User.find_or_create_by(:uid => auth['uid']) do |u|
        u.name = auth['info']['name']
        u.email = auth['info']['email']
      end
    else #coming from signin page
      user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jesseN"], ["LIMIT", 1]]