app/controllers/upvotes_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "upvotes" ("voter_id", "answer_id") VALUES (?, ?)  [["voter_id", 3], ["answer_id", 1]]
---
  def create
    answer = Answer.find(params[:answer_id])
    upvote = answer.upvotes.build(voter_id: current_user.id)
    Upvote.find_by(id: upvote.errors.messages[:answer][0]).try(:delete) unless upvote.save