app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest") VALUES (?, ?)  [["username", "jesse"], ["password_digest", "$2a$10$qxhKe8qH48VuPUl5nLmAu.tziRPYp9lhLQ0LZvSKxc.NESGfH8oKW"]]
---
  def create
    @user = User.create(user_params)